IDEA Open Model
PolyLine3D.Segments Property
Compatible with IDEA StatiCa Beta 20.0
 Gets or sets list of references to Segment3D of PolyLine3D.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public List<ReferenceElement> Segments { get; set; }
Public Property Segments As List(Of ReferenceElement)
	Get
	Set
Property Value
Type: List<ReferenceElement>
See Also
Reference
PolyLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace